Imports

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

Load Dataset

In [3]:
df = pd.read_csv('../data/Real_estate.csv')

df Overview

In [4]:
df.head()

,ID,Distance_to_Center,Num_Bathrooms,Num_Bedrooms,Square_Feet,Year_Built,Price
0,0,7.317716,2,1,267.149782,1950,515701.338404
1,1,13.522508,2,3,106.067327,2005,581050.851572
2,2,3.338621,2,3,258.110660,1973,685123.534051
3,3,4.011060,2,3,143.895738,1901,413609.134685
4,4,17.837862,2,1,81.765128,1910,291630.925913

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  500 non-null    int64
 1   Distance_to_Center  500 non-null    float64
 2   Num_Bathrooms       500 non-null    int64
 3   Num_Bedrooms        500 non-null    int64
 4   Square_Feet         500 non-null    float64
 5   Year_Built          500 non-null    int64
 6   Price               500 non-null    float64
dtypes: float64(3), int64(4)
memory usage: 27.5 KB

In [6]:
df.describe()

,ID,Distance_to_Center,Num_Bathrooms,Num_Bedrooms,Square_Feet,Year_Built,Price
count,500.000000,500.000000,500.000000,500.000000,500.000000,500.000000,500.000000
mean,249.500000,10.469641,1.976000,2.958000,174.640428,1957.604000,582209.629529
std,144.481833,5.588197,0.820225,1.440968,74.672102,35.491781,122273.390345
min,0.000000,0.062818,1.000000,1.000000,51.265396,1900.000000,276892.470136
25%,124.750000,6.066754,1.000000,2.000000,110.319923,1926.000000,503080.344140
50%,249.500000,10.886066,2.000000,3.000000,178.290937,1959.000000,574724.113347
75%,374.250000,15.072590,3.000000,4.000000,239.031220,1988.000000,665942.301274
max,499.000000,19.927966,3.000000,5.000000,298.241199,2022.000000,960678.274291